{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, 256, 256, 3]], "num_parameters": 0}, {"name": "model", "id": "model", "class_name": "Functional", "output_shape": [[null, 128, 128, 96], [null, 64, 64, 144], [null, 32, 32, 192], [null, 16, 16, 576], [null, 8, 8, 320]], "num_parameters": 1841984}, {"name": "sequential", "id": "sequential", "class_name": "Sequential", "output_shape": [null, 16, 16, 512], "num_parameters": 1476608}, {"name": "concatenate", "id": "concatenate", "class_name": "Concatenate", "output_shape": [null, 16, 16, 1088], "num_parameters": 0}, {"name": "sequential_1", "id": "sequential_1", "class_name": "Sequential", "output_shape": [null, 32, 32, 256], "num_parameters": 2507776}, {"name": "concatenate_1", "id": "concatenate_1", "class_name": "Concatenate", "output_shape": [null, 32, 32, 448], "num_parameters": 0}, {"name": "sequential_2", "id": "sequential_2", "class_name": "Sequential", "output_shape": [null, 64, 64, 128], "num_parameters": 516608}, {"name": "concatenate_2", "id": "concatenate_2", "class_name": "Concatenate", "output_shape": [null, 64, 64, 272], "num_parameters": 0}, {"name": "sequential_3", "id": "sequential_3", "class_name": "Sequential", "output_shape": [null, 128, 128, 64], "num_parameters": 156928}, {"name": "concatenate_3", "id": "concatenate_3", "class_name": "Concatenate", "output_shape": [null, 128, 128, 160], "num_parameters": 0}, {"name": "conv2d_transpose_4", "id": "conv2d_transpose_4", "class_name": "Conv2DTranspose", "output_shape": [null, 256, 256, 1], "num_parameters": 1441}], "edges": [["input_2", "model"], ["model", "sequential"], ["sequential", "concatenate"], ["model", "concatenate"], ["concatenate", "sequential_1"], ["sequential_1", "concatenate_1"], ["model", "concatenate_1"], ["concatenate_1", "sequential_2"], ["sequential_2", "concatenate_2"], ["model", "concatenate_2"], ["concatenate_2", "sequential_3"], ["sequential_3", "concatenate_3"], ["model", "concatenate_3"], ["concatenate_3", "conv2d_transpose_4"]]}